{
    "basic_info": {
      "description_header": "Hi",
      "description": "👋 I am Abdulahi Mohamud, a full-stack software developer based in Seattle with a background in cybersecurity. I am skilled in programming languages such as Java, JavaScript, HTML, CSS, and Markdown, and I am also fluent in Somali, Arabic, and Kiswahili. I have experience in designing, testing, and deploying software programs and applications, as well as troubleshooting and debugging existing software. I have worked on several projects, including an Android application to track BMI and weight loss, a full-stack communication web app, and a full-stack web application to help users find fun destinations. I hold a Bachelor of Science degree in Computer Science from Washington University and have completed a certificate in Advanced Software Development in Java with SpringMVC & Android from Code Fellows, as well as an Associate of Science degree in Network Security Admin from Highline College.",
      "section_name": {
        "about": "About me",
        "projects": "Projects",
        "skills": "Skills",
        "experience": "Experience"
      }
    },
    "projects": [
      {
        "title": "BetterMe",
        "startDate": "2022",
        "description": "Android application used to help user track BMI and weight loss while giving then workouts to do and has Built in gps to locate and route to nearest gym, park or supplements store",
        "images": [
          "images/portfolio/betterMe/img.png",
          "images/portfolio/betterMe/signup.png",
          "images/portfolio/betterMe/update info.JPG"
        ],
        "url": "https://github.com/TeamWondrs/betterMe",
        "technologies": [
          {
            "class": "devicon-java-plain",
            "name": "JAVA"
          }
        ]
      },
      {
        "title": "Gwitr",
        "startDate": "2022",
        "description": "Java buit full-stack livecommunication web app that scalable to over 10,000+ users and allows users to follow and chat with other users. uses multiple RESTFUL APIs to populate data to help user experience. ",
        "images": [
          "images/portfolio/gwiter/gwiterlogo2.png"
          
        ],
        "url": "https://github.com/DreamTeam-Java/Gwitr",
        "technologies": [
          {
            "class": "devicon-java-plain",
            "name": "JAVA"
          }
        ]
      },
      {
        "title": "NextMeal",
        "startDate": "2022",
        "description": "NextMeal is a dynamic web application built using Java and Reactjs that helps users explore and discover delicious dining options. It provides comprehensive information about restaurants, including menu items, prices, and locations. With NextMeal, users can easily find their next culinary adventure and save their favorite spots for future visits.",
        "images": [
          "images/portfolio/adventure/p1.jpg",
          "images/portfolio/adventure/p2.jpg"
        ],
        "url": "https://github.com/AbdulahiMohamud/NexMeal  && https://github.com/AbdulahiMohamud/NexMeal_Backend",
        "technologies": [
          {
            "class": "devicon-html5-plain",
            "name": "HTML 5"
          },
          {
            "class": "devicon-sass-original",
            "name": "Sass"
          },
          {
            "class": "devicon-javascript-plain",
            "name": "JavaScript"
          }
        ]
      }
    ],
    "experience": [
      {
        "company": "Allied Universal",
        "title": "Security Officer",
        "years": "10.2019 - present",
        "mainTech": [
          "Alarm Mangment"
        ],
        "technologies": [
          "Team skills",
          "Wrok well under presure",
          "Communication",
          "Accountability"
        ]
      },
      {
        "company": "SearchEgg",
        "title": "Software Developer Internship",
        "years": "07.2022 - 01.2023",
        "mainTech": [
          "FullStack"
        ],
        "technologies": [
          "Team skills",
          "Troubleshooting, debugging, maintaining and improving existing software",
          "Testing and deploying programs and applications",
          "Communication",
          "Designing algorithms and flowcharts to create new software programs and systems"
        ]
      }
      
    ]
  }
